{"format": "graph-model", "generatedBy": "2.14.0", "convertedBy": "TensorFlow.js Converter v4.12.0", "signature": {"inputs": {"args_0_3:0": {"name": "args_0_3:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0:0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "gradient_boosted_trees_model/1322:0": {"name": "gradient_boosted_trees_model/1322:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1172}, "args_0_2:0": {"name": "args_0_2:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_4:0": {"name": "args_0_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "gradient_boosted_trees_model/1318:0": {"name": "gradient_boosted_trees_model/1318:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1156}, "args_0_5:0": {"name": "args_0_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_6:0": {"name": "args_0_6:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_1:0": {"name": "args_0_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "gradient_boosted_trees_model/1314:0": {"name": "gradient_boosted_trees_model/1314:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1164}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_26", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_6", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "gradient_boosted_trees_model/1314", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "gradient_boosted_trees_model/1318", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "gradient_boosted_trees_model/1322", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["args_0_3"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["gradient_boosted_trees_model/1314", "args_0_2", "Func/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_24"], "attr": {"Tout": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "Tin": {"type": "DT_STRING"}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup_1/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["gradient_boosted_trees_model/1318", "args_0_6", "Func/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_26"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack", "op": "Pack", "input": ["args_0", "args_0_5", "args_0_1", "args_0_4", "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast"], "attr": {"N": {"i": "5"}, "axis": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack_1", "op": "Pack", "input": ["gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup/LookupTableFindV2", "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup_1/LookupTableFindV2"], "attr": {"axis": {"i": "1"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack", "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/Const", "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack_1", "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "gradient_boosted_trees_model/1322"], "attr": {"dense_output_dim": {"i": "3"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/inference_op"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1575}}, "modelInitializer": {"node": [{"name": "1486", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "1490", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "1492", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "1496", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "4"}]}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "1498", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_26", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_26"], "attr": {"container": {"s": ""}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzkyZTg5YWUzLTNiMGMtNGYyNC05ZmU0LWRmMzMwZTZjNzdkM19sb2FkXzgwNg=="}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_27", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_27", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^1486", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_31", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["1486", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_30", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_30"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": ""}, "pattern": {"s": "M2YyZTcxZDkwYmNiNGNmY2RvbmU="}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_31", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"_has_manual_control_dependencies": {"b": true}, "output_types": {"list": {}}, "allow_slow_inference": {"b": true}, "file_prefix": {"s": "M2YyZTcxZDkwYmNiNGNmYw=="}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_33", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_34", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/input_control_node/_8"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_34"], "attr": {"value_dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "container": {"s": ""}, "use_node_name_sharing": {"b": true}, "key_dtype": {"type": "DT_STRING"}, "shared_name": {"s": "MjIyX2xvYWRfODA2XzExNDA="}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_35", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_35", "^StatefulPartitionedCall_2/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall_2/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/input_control_node/_11", "op": "NoOp", "input": ["^1490", "^1492", "^Func/StatefulPartitionedCall_2/output/_9"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_9", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_38", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_12", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_13", "op": "Identity", "input": ["1490", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_39", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_13", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_14", "op": "Identity", "input": ["1492", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_40", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_14", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall_3/StatefulPartitionedCall/key_value_init221/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_38", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_39", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_40"], "attr": {"Tout": {"type": "DT_INT32"}, "Tin": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_42", "op": "NoOp", "input": ["^StatefulPartitionedCall_3/StatefulPartitionedCall/key_value_init221/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/output_control_node/_16", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/output_control_node/_10", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/input_control_node/_17", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/input_control_node/_43", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/input_control_node/_17"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/input_control_node/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}, "key_dtype": {"type": "DT_STRING"}, "use_node_name_sharing": {"b": true}, "container": {"s": ""}, "value_dtype": {"type": "DT_INT32"}, "shared_name": {"s": "MjI4X2xvYWRfODA2XzkxNQ=="}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45", "op": "NoOp", "input": ["^StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/output_control_node/_19", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall_4/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output/_44", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall_4/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output/_44", "^StatefulPartitionedCall_4/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/output/_18", "op": "Identity", "input": ["StatefulPartitionedCall_4/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/input_control_node/_20", "op": "NoOp", "input": ["^1496", "^1498", "^Func/StatefulPartitionedCall_4/output/_18"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/input/_21", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/output/_18", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_47", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_21", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/input/_22", "op": "Identity", "input": ["1496", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_48", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_22", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/input/_23", "op": "Identity", "input": ["1498", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_49", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_23", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall_5/StatefulPartitionedCall/key_value_init227/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_47", "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_48", "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_49"], "attr": {"Tin": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}, "Tout": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/output_control_node/_51", "op": "NoOp", "input": ["^StatefulPartitionedCall_5/StatefulPartitionedCall/key_value_init227/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/output_control_node/_25", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/output_control_node/_51"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^Func/StatefulPartitionedCall_2/output_control_node/_10", "^Func/StatefulPartitionedCall_3/output_control_node/_16", "^Func/StatefulPartitionedCall_4/output_control_node/_19", "^Func/StatefulPartitionedCall_5/output_control_node/_25"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Identity_1", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_9", "^Func/StatefulPartitionedCall_3/output_control_node/_16", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Identity_2", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/output/_18", "^Func/StatefulPartitionedCall_5/output_control_node/_25", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1575}}, "initializerSignature": {"outputs": {"Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1156}, "Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1172}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1164}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "Func/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_24", "shape": [], "dtype": "int32"}, {"name": "Func/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_26", "shape": [], "dtype": "int32"}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "1486", "shape": [], "dtype": "string"}, {"name": "1490", "shape": [5], "dtype": "string"}, {"name": "1492", "shape": [5], "dtype": "int32"}, {"name": "1496", "shape": [4], "dtype": "string"}, {"name": "1498", "shape": [4], "dtype": "int32"}]}]}