{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 3475}, "unknown_1:0": {"name": "unknown_1:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 3467}, "args_0_2:0": {"name": "args_0_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_1:0": {"name": "args_0_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown_3:0": {"name": "unknown_3:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 3483}, "args_0_6": {"name": "args_0_6:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0:0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_5:0": {"name": "args_0_5:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_3:0": {"name": "args_0_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "args_0_4:0": {"name": "args_0_4:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_STRING"}}}, {"name": "args_0_5", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "args_0_6", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "unknown_1", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "unknown_3", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14", "op": "NoOp", "input": ["^args_0", "^args_0_1", "^unknown_1", "^unknown_3", "^args_0_2", "^args_0_3", "^args_0_4", "^args_0_5", "^args_0_6", "^unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["args_0_6", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_38", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_40", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack", "op": "Pack", "input": ["args_0", "args_0_1", "args_0_2", "args_0_3", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/PartitionedCall/Cast"], "attr": {"axis": {"i": "1"}, "N": {"i": "5"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "args_0_4", "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_38"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup_1/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown_1", "args_0_5", "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tout": {"type": "DT_INT32"}, "Tin": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/None_Lookup_1/LookupTableFindV2"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "1"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/Const", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/stack_1", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown_3"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "3"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/inference_op"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "modelInitializer": {"node": [{"name": "3759", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "3763", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "3765", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "3769", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "3771", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_26", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_52", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_26"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_78", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_52"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_78"], "attr": {"container": {"s": ""}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsX2UzNzU4NTg4LTgxOTAtNDU0OC04YjA2LTI1ZTRkZDNiOTJjZF9sb2FkXzgwNl9sb2FkXzMwNjM="}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_79", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_80", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_80"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_79", "^StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_53", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_54", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_80"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_54"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_53", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_27", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_54"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_27", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^3759", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_31", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_55", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input/_57", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_31", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_55"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_81", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_55"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_83", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input/_57", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_81"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["3759", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_30", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input/_56", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_30", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_55"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_82", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/input/_56", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_81"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_82"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "NTQ1NTc5NzVkZjhlNDY0Y2RvbmU="}, "rewrite": {"s": ""}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_83", "StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"output_types": {"list": {}}, "file_prefix": {"s": "NTQ1NTc5NzVkZjhlNDY0Yw=="}, "allow_slow_inference": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_85", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_59", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_85"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_33", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_59"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_34", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/input_control_node/_8"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_60", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_86", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_60"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_86"], "attr": {"shared_name": {"s": "MjIyX2xvYWRfODA2XzExNDBfbG9hZF8zMDYz"}, "key_dtype": {"type": "DT_STRING"}, "container": {"s": ""}, "_has_manual_control_dependencies": {"b": true}, "value_dtype": {"type": "DT_INT32"}, "use_node_name_sharing": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_87", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_88", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_88"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_87", "^StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/output/_61", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_62", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_88"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_62"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/output/_61", "^StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_35", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_62"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_35", "^StatefulPartitionedCall_2/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall_2/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/input_control_node/_11", "op": "NoOp", "input": ["^3763", "^3765", "^Func/StatefulPartitionedCall_2/output/_9"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_9", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_38", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_12", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_63", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input/_64", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_38", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_63"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_89", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_63"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_90", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input/_64", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_89"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_13", "op": "Identity", "input": ["3763", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_39", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_13", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input/_65", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_39", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_63"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_91", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input/_65", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_89"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_14", "op": "Identity", "input": ["3765", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_40", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_14", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input/_66", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_40", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_63"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_92", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/input/_66", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_89"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/key_value_init221/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_90", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_91", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_92"], "attr": {"_has_manual_control_dependencies": {"b": true}, "Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_94", "op": "NoOp", "input": ["^StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/key_value_init221/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_68", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_94"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_42", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_68"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/output_control_node/_16", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/output_control_node/_10", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/input_control_node/_17", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/input_control_node/_43", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/input_control_node/_17"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_69", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/input_control_node/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_95", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_69"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_95"], "attr": {"shared_name": {"s": "MjI4X2xvYWRfODA2XzkxNV9sb2FkXzMwNjM="}, "_has_manual_control_dependencies": {"b": true}, "key_dtype": {"type": "DT_STRING"}, "container": {"s": ""}, "use_node_name_sharing": {"b": true}, "value_dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_97", "op": "NoOp", "input": ["^StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_71", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_97"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_71"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/output_control_node/_19", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_96", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_97"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output/_96", "^StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/output/_70", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_71"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/StatefulPartitionedCall/StatefulPartitionedCall/output/_70", "^StatefulPartitionedCall_4/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output/_44", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall_4/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output/_44", "^StatefulPartitionedCall_4/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/output/_18", "op": "Identity", "input": ["StatefulPartitionedCall_4/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/input_control_node/_20", "op": "NoOp", "input": ["^3769", "^3771", "^Func/StatefulPartitionedCall_4/output/_18"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/input/_21", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/output/_18", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_47", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_21", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_72", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input/_73", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_47", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_72"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_98", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_72"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_99", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input/_73", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_98"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/input/_22", "op": "Identity", "input": ["3769", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_48", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_22", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input/_74", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_48", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_72"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_100", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input/_74", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_98"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/input/_23", "op": "Identity", "input": ["3771", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_49", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_23", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input/_75", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_49", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_72"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_101", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/input/_75", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_98"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/key_value_init227/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_99", "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_100", "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/input/_101"], "attr": {"Tout": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "Tin": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_103", "op": "NoOp", "input": ["^StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/key_value_init227/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_77", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_103"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/output_control_node/_51", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_77"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/output_control_node/_25", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/output_control_node/_51"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^Func/StatefulPartitionedCall_2/output_control_node/_10", "^Func/StatefulPartitionedCall_3/output_control_node/_16", "^Func/StatefulPartitionedCall_4/output_control_node/_19", "^Func/StatefulPartitionedCall_5/output_control_node/_25"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Identity_1", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_9", "^Func/StatefulPartitionedCall_3/output_control_node/_16", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Identity_2", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/output/_18", "^Func/StatefulPartitionedCall_5/output_control_node/_25", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1645}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 3483}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 3467}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 3475}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_38", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/input/_40", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "3759", "shape": [], "dtype": "string"}, {"name": "3763", "shape": [5], "dtype": "string"}, {"name": "3765", "shape": [5], "dtype": "int32"}, {"name": "3769", "shape": [4], "dtype": "string"}, {"name": "3771", "shape": [4], "dtype": "int32"}]}]}