{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.16.0", "signature": {"inputs": {"unknown_3:0": {"name": "unknown_3:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 14025}, "body_mass_g:0": {"name": "body_mass_g:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "bill_length_mm:0": {"name": "bill_length_mm:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "island:0": {"name": "island:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 14017}, "sex:0": {"name": "sex:0", "dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "-1"}]}}, "year": {"name": "year:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown_1:0": {"name": "unknown_1:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 14009}, "bill_depth_mm:0": {"name": "bill_depth_mm:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "flipper_length_mm:0": {"name": "flipper_length_mm:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "bill_depth_mm", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "bill_length_mm", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "body_mass_g", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "flipper_length_mm", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "island", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "sex", "op": "Placeholder", "attr": {"dtype": {"type": "DT_STRING"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "unknown_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "unknown_3", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "year", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14", "op": "NoOp", "input": ["^bill_depth_mm", "^bill_length_mm", "^unknown_1", "^unknown_3", "^body_mass_g", "^flipper_length_mm", "^island", "^sex", "^year", "^unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["year", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input/_23", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input/_25", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input_control_node/_14"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/stack", "op": "Pack", "input": ["bill_depth_mm", "bill_length_mm", "body_mass_g", "flipper_length_mm", "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/PartitionedCall/Cast"], "attr": {"N": {"i": "5"}, "axis": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/None_Lookup/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown", "island", "Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input/_23"], "attr": {"Tout": {"type": "DT_INT32"}, "Tin": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/None_Lookup_1/LookupTableFindV2", "op": "LookupTableFindV2", "input": ["unknown_1", "sex", "Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input/_25"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/None_Lookup/LookupTableFindV2", "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/None_Lookup_1/LookupTableFindV2"], "attr": {"axis": {"i": "1"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/stack", "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/Const", "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/stack_1", "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown_3"], "attr": {"dense_output_dim": {"i": "3"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/inference_op"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "modelInitializer": {"node": [{"name": "14278", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "14282", "op": "Const", "attr": {"dtype": {"type": "DT_STRING"}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "5"}]}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "14284", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "14288", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "14290", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_26", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_26"], "attr": {"shared_name": {"s": "c2ltcGxlX21sX21vZGVsX2M0N2RkMDBlLTcwMjQtNGY0MS1hOTNhLTgxNDUwN2M3MmQ2Y19sb2FkXzEzNjU5"}, "_has_manual_control_dependencies": {"b": true}, "container": {"s": ""}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_27", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_27", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^14278", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_31", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["14278", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_30", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_29"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_30"], "attr": {"rewrite": {"s": ""}, "replace_global": {"b": true}, "pattern": {"s": "YjE4MDJhZTMyZjRmNDRhNmRvbmU="}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_31", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"file_prefix": {"s": "YjE4MDJhZTMyZjRmNDRhNg=="}, "output_types": {"list": {}}, "_has_manual_control_dependencies": {"b": true}, "allow_slow_inference": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_33", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_34", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/input_control_node/_8"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/input_control_node/_34"], "attr": {"container": {"s": ""}, "value_dtype": {"type": "DT_INT32"}, "shared_name": {"s": "MTEzNjVfbG9hZF8xMzY1OV8xMzY2MA=="}, "key_dtype": {"type": "DT_STRING"}, "use_node_name_sharing": {"b": true}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall_2/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_35", "op": "Identity", "input": ["StatefulPartitionedCall_2/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36", "op": "NoOp", "input": ["^StatefulPartitionedCall_2/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_2/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output/_35", "^StatefulPartitionedCall_2/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_2/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall_2/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/input_control_node/_11", "op": "NoOp", "input": ["^14282", "^14284", "^Func/StatefulPartitionedCall_2/output/_9"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_9", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_38", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_12", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_13", "op": "Identity", "input": ["14282", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_39", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_13", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_3/input/_14", "op": "Identity", "input": ["14284", "^Func/StatefulPartitionedCall_3/input_control_node/_11"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_40", "op": "Identity", "input": ["Func/StatefulPartitionedCall_3/input/_14", "^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input_control_node/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall_3/StatefulPartitionedCall/key_value_init11364/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_38", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_39", "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/input/_40"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_42", "op": "NoOp", "input": ["^StatefulPartitionedCall_3/StatefulPartitionedCall/key_value_init11364/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_3/output_control_node/_16", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_3/StatefulPartitionedCall/output_control_node/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_2/output_control_node/_10", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/StatefulPartitionedCall/output_control_node/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/input_control_node/_17", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_2/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/input_control_node/_43", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/input_control_node/_17"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table", "op": "HashTableV2", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/input_control_node/_43"], "attr": {"use_node_name_sharing": {"b": true}, "container": {"s": ""}, "_has_manual_control_dependencies": {"b": true}, "shared_name": {"s": "MTEzNzFfbG9hZF8xMzY1OV8xMzY3MA=="}, "key_dtype": {"type": "DT_STRING"}, "value_dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45", "op": "NoOp", "input": ["^StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_4/output_control_node/_19", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/hash_table", "^StatefulPartitionedCall_4/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output/_44", "op": "Identity", "input": ["StatefulPartitionedCall_4/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall_4/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output_control_node/_45"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall_4/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/StatefulPartitionedCall/output/_44", "^StatefulPartitionedCall_4/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_4/output/_18", "op": "Identity", "input": ["StatefulPartitionedCall_4/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/input_control_node/_20", "op": "NoOp", "input": ["^14288", "^14290", "^Func/StatefulPartitionedCall_4/output/_18"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/input/_21", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/output/_18", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_47", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_21", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_5/input/_22", "op": "Identity", "input": ["14288", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_48", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_22", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_5/input/_23", "op": "Identity", "input": ["14290", "^Func/StatefulPartitionedCall_5/input_control_node/_20"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_49", "op": "Identity", "input": ["Func/StatefulPartitionedCall_5/input/_23", "^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input_control_node/_46"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall_5/StatefulPartitionedCall/key_value_init11370/LookupTableImportV2", "op": "LookupTableImportV2", "input": ["Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_47", "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_48", "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/input/_49"], "attr": {"Tin": {"type": "DT_STRING"}, "Tout": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/StatefulPartitionedCall/output_control_node/_51", "op": "NoOp", "input": ["^StatefulPartitionedCall_5/StatefulPartitionedCall/key_value_init11370/LookupTableImportV2"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_5/output_control_node/_25", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_5/StatefulPartitionedCall/output_control_node/_51"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^Func/StatefulPartitionedCall_2/output_control_node/_10", "^Func/StatefulPartitionedCall_3/output_control_node/_16", "^Func/StatefulPartitionedCall_4/output_control_node/_19", "^Func/StatefulPartitionedCall_5/output_control_node/_25"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Identity_1", "op": "Identity", "input": ["Func/StatefulPartitionedCall_2/output/_9", "^Func/StatefulPartitionedCall_3/output_control_node/_16", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Identity_2", "op": "Identity", "input": ["Func/StatefulPartitionedCall_4/output/_18", "^Func/StatefulPartitionedCall_5/output_control_node/_25", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1645}}, "initializerSignature": {"outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 14017}, "Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 14025}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 14009}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input/_23", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/input/_25", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_6/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "14278", "shape": [], "dtype": "string"}, {"name": "14282", "shape": [5], "dtype": "string"}, {"name": "14284", "shape": [5], "dtype": "int32"}, {"name": "14288", "shape": [4], "dtype": "string"}, {"name": "14290", "shape": [4], "dtype": "int32"}]}]}